"""
Дано список з n (1 ≤ n ≤ 100000) цілих чисел і число k (|k| <
100000). Циклічно посуньте список на |k| елементів вправо, якщо k -
додатне і вліво, якщо від’ємне число. Програма отримує на вхід список
цілих чисел, потім число k. Рішення повинно мати складність O(n), тобто
не повинно залежати від k. Додатковим списком користуватися не можна

Автор: Савченко Валентина 31І
"""

n = int(input("Введіть число n - кількість чисел у списку: "))
nums = list()
stop = False
for i in range(n):
    el = input("Введіть числo, якe входuть в список: ")
    el = int(el)
    if el < 1 or el > 100000:
        print("Числа не можуть бути більше за 100000 і менше за 1")
        stop = True
        break
    else:
        nums.append(el)
if not stop:
    print(*nums)
    k = int(input("Введіть ціле число k - кількість елементів для зсуву: "))
    if k > 100000:
        print("Число k не можe бути більше за 100000")
    else:
        nums[:] = nums[-k:] + nums[:-k]
        print(*nums[:])
