
"""
Дано список з n (1 ≤ n ≤ 100000) цілих чисел і число k (|k| <
100000). Циклічно посуньте список на |k| елементів вправо, якщо k -
додатне і вліво, якщо від’ємне число. Програма отримує на вхід список
цілих чисел, потім число k. Рішення повинно мати складність O(n), тобто
не повинно залежати від k. Додатковим списком користуватися не можна

Автор: Савченко Валентина 31І
"""
n = int(input("Введіть ціле число n: "))
L = list(range(1, n+1))
print(L)
k = int(input("Введіть ціле число k:"))

list_r = L[-k:] + L[:-k]
print(f"Циклічний зсув в право: {list_r}")

list_l = L[k:] + L[:k]
print((f"Циклічний зсув в ліво: {list_l}"))
